# 컴퓨터 과학 교양 강좌 : cs 50

---

# chapter 4 : 프로그래밍 응용

<br> <br>

# 소단원

## 1. 컴파일

- 컴파일 이란? <br>
  컴파일은 소스 코드를 오브젝트 코드로 변환시키는 과정입니다. 여기서 소스 코드는 여러분이 C언어와 같은 프로그래밍 언어로 작성한 코드이고, 오브젝트 코드는 기계 코드라고도 알려져 있는데, 0과 1로 이루어져 있으며 컴퓨터에게 프로그램이 어떻게 실행되어야 하는지 알려주는 코드입니다. make 명령어 자체는 컴파일러가 아니고, clang이라는 컴파일러를 호출해서 C 소스 코드를 오브젝트 코드로 컴파일 하도록 합니다.

      1. 전처리(Precompile)
      컴파일의 전체 과정은 네 단계로 나누어볼 수 있습니다.
      그 중 첫 번째 단계는 전처리인데, 전처리기에 의해 수행됩니다.
      # 으로 시작되는 C 소스 코드는 전처리기에게 실질적인 컴파일이 이루어지기 전에 무언가를 실행하라고 알려줍니다.

      예를 들어, #include는 전처리기에게 다른 파일의 내용을 포함시키라고 알려줍니다.
      프로그램의 소스 코드에 #include 와 같은 줄을 포함하면,
      전처리기는 새로운 파일을 생성하는데 이 파일은 여전히 C 소스 코드 형태이며 stdio.h 파일의 내용이 #include 부분에 포함됩니다.

      2. 컴파일(Compile)
      전처리기가 전처리한 소스 코드를 생성하고 나면 그 다음 단계는 컴파일입니다.
      컴파일러라고 불리는 프로그램은 C 코드를 어셈블리어라는 저수준 프로그래밍 언어로 컴파일합니다.

      어셈블리는 C보다 연산의 종류가 훨씬 적지만, 여러 연산들이 함께 사용되면 C에서 할 수 있는 모든 것들을 수행할 수 있습니다.
      C 코드를 어셈블리 코드로 변환시켜줌으로써 컴파일러는 컴퓨터가 이해할 수 있는 언어와 최대한 가까운 프로그램으로 만들어 줍니다.
      컴파일이라는 용어는 소스 코드에서 오브젝트 코드로 변환하는 전체 과정을 통틀어 일컫기도 하지만,
      구체적으로 전처리한 소스 코드를 어셈블리 코드로 변환시키는 단계를 말하기도 합니다.

      3. 어셈블(Assemble)
      소스 코드가 어셈블리 코드로 변환되면, 다음 단계인 어셈블 단계로 어셈블리 코드를 오브젝트 코드로 변환시키는 것입니다.
      컴퓨터의 중앙처리장치가 프로그램을 어떻게 수행해야 하는지 알 수 있는 명령어 형태인 연속된 0과 1들로 바꿔주는 작업이죠.
      이 변환작업은 어셈블러라는 프로그램이 수행합니다.
      소스 코드에서 오브젝트 코드로 컴파일 되어야 할 파일이 딱 한 개라면, 컴파일 작업은 여기서 끝이 납니다.
      그러나 그렇지 않은 경우에는 링크라 불리는 단계가 추가됩니다.

      4. 링크(Link)
      만약 프로그램이 (math.h나 cs50.h와 같은 라이브러리를 포함해) 여러 개의 파일로 이루어져 있어 하나의 오브젝트 파일로
      합쳐져야 한다면 링크라는 컴파일의 마지막 단계가 필요합니다.
      링커는 여러 개의 다른 오브젝트 코드 파일을 실행 가능한 하나의 오브젝트 코드 파일로 합쳐줍니다.
      예를 들어, 컴파일을 하는 동안에 CS50 라이브러리를 링크하면 오브젝트 코드는
      GetInt()나 GetString() 같은 함수를 어떻게 실행할 지 알 수 있게 됩니다.

## 2. 버그와 디버깅

- 버그란? <br>
  버그(bug)는 코드에 들어있는 오류입니다. 버그로 인해 프로그램의 실행에 실패하거나 프로그래머가 원하는 대로 동작하지 않게 됩니다. 버그를 만들고 싶지 않겠지만 모든 프로그래머들은 버그와 마주하게 되어있습니다.

- 디버깅이란? <br>
  디버깅(debugging)은 코드에 있는 버그를 식별하고 고치는 과정입니다. 프로그래머는 디버거라고 불리는 프로그램을 사용하여 디버깅을 하게 됩니다.

        1. GDB
        컴파일의 전체 과정은 네 단계로 나누어볼 수 있습니다.
        그 중 첫 번째 단계는 전처리인데, 전처리기에 의해 수행됩니다.
        # 으로 시작되는 C 소스 코드는 전처리기에게 실질적인 컴파일이 이루어지기 전에 무언가를 실행하라고 알려줍니다.

## 3. 함수와 리턴

- 함수란? <br>
  함수는 특정 목적을 위해 만들어진 재사용 가능한 코드입니다. 함수는 입력값과 출력값을 가지며 프로그램 내의 어디에서든 재사용될 수 있습니다. 프로그램을 여러 개의 함수로 만들면 코드를 조직화하고 간단하게 만들 수 있습니다. 이것이 추상화의 한 예입니다. 함수를 한번 작성하면 그 함수가 구체적으로 어떻게 만들어졌는지 몰라도 함수를 사용할 수 있습니다. 그리고 함수를 만들지 않은 사람도 저수준의 상세 내용을 신경 쓰지 않고 함수를 사용(호출)할 수 있습니다.

## 4. 라이브러리

- 라이브러리란? <br>
  라이브러리는 프로그래머들이 이미 만들어진 코드를 다시 개발하지 않아도 되게 하고, 서로 함께 작업할 수 있도록 만들어주는 함수의 모음입니다. 라이브러리는 문자를 대문자에서 소문자로 변환하거나, 문자열을 정수로 변환하는 것 등 C에서 자주 쓰이는 연산들의 함수를 포함합니다. 여러분의 프로그램에서 비슷한 기능을 수행해야 한다면, 이미 만들어져 있는 함수를 또 만드는 대신 이미 존재하는 라이브러리를 그대로 사용할 수 있습니다.